{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "appetizers-and-snacks",
    "1": "bread",
    "2": "breakfast-and-brunch",
    "3": "desserts",
    "4": "drinks",
    "5": "fruits-and-vegetables",
    "6": "main-dish",
    "7": "meat-and-poultry",
    "8": "salad",
    "9": "seafood",
    "10": "side-dish",
    "11": "soups-stews-and-chili"
  },
  "initializer_range": 0.02,
  "label2id": {
    "appetizers-and-snacks": 0,
    "bread": 1,
    "breakfast-and-brunch": 2,
    "desserts": 3,
    "drinks": 4,
    "fruits-and-vegetables": 5,
    "main-dish": 6,
    "meat-and-poultry": 7,
    "salad": 8,
    "seafood": 9,
    "side-dish": 10,
    "soups-stews-and-chili": 11
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
